# NoCurtainRoofsInMassing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..NoCurtainRoofsInMassing Property
BuiltInFailures..::..MassFailures Class See Also
---
Massing cannot be created with a curtain roof. Please change the default roof type and try again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoCurtainRoofsInMassing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoCurtainRoofsInMassing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoCurtainRoofsInMassing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace